Информационная_база/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>EnumRef.Роли</types>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/Enums/Роли/Роли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Роли</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Catalogs/Пользователи/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если УникальныйИдентификатор = "" Тогда
		Пользователь			=	ПользователиИнформационнойБазы.СоздатьПользователя();
	    Пользователь.Имя		=	Наименование;
	    Пользователь.ПолноеИмя	=	Наименование;
		
	    Если КоличествоПользователей() Тогда
	        Пользователь.Роли.Добавить(Метаданные.Роли.Пользователь);
			Роль = Перечисления.Роли.Пользователь;
		Иначе 
			Пользователь.Роли.Добавить(Метаданные.Роли.Администратор);
			Роль = Перечисления.Роли.Администратор;
		КонецЕсли; 
		
	    Пользователь.ПоказыватьВСпискеВыбора = Истина;
	        
	    Пользователь.Записать();
	    УникальныйИдентификатор = Пользователь.УникальныйИдентификатор;
    КонецЕсли;
КонецПроцедуры  


Функция КоличествоПользователей()
	КоличествоПользователей = 0;
	Пользователи = Справочники.Пользователи.Выбрать();
	
	Пока Пользователи.Следующий() Цикл
		КоличествоПользователей = КоличествоПользователей + 1;
	КонецЦикла;
	
	Возврат КоличествоПользователей;
КонецФункции
